# 29 - Random Sampling pada Pandas Data Frame

# Import Modules

In [1]:
import pandas as pd

print(pd.__version__)

1.2.4

# Persiapan Data Frame

-mempunyai 2 bagian kolom

In [2]:
d = {'col_1':[1, 2, 3, 4, 5],
    'col_2':[10, 20, 30, 40, 50]}
df = pd.DataFrame(d)
df

   col_1  col_2
0      1     10
1      2     20
2      3     30
3      4     40
4      5     50

# Random Sampling with / without replacemant

-untuk replace menggunakan df.sampe yang disertakan oleh 3 parameter . yang pertama jumlah data yang mau kita sampe, kedua replace nya false ,ketiga random state nya 0

-untuk without menggunakan df.sampe yang disertakan oleh 3 parameter . yang pertama jumlah data yang mau kita sampe, kedua replace nya true ,ketiga random state nya 0

In [3]:
df.sample(n=4, replace=False, random_state=0)

   col_1  col_2
2      3     30
0      1     10
1      2     20
3      4     40

In [4]:
df.sample(n=4, replace=True, random_state=0)

   col_1  col_2
4      5     50
0      1     10
3      4     40
3      4     40